#include "Main.h"
#include "Game.h"
#include "Camera.h"
#include "Random.h"

//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Camera::Init()
{
	m_pos.set(0.0f, 10.0f, -15.0f);
	m_rot.set(30.0f, 0.0f, 0.0f);
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Camera::Update(Float3 player_pos, Float3 player_rot)
{
	Float3 base(0.0f, 2.0f, -12.0f);
	MATRIX mat = MGetRotY(TO_RADIAN(player_rot.y));

	Float3 dir = GetFloat3VTransform(base, mat);

	m_pos = player_pos + dir;

	m_rot.x = 0.0f;
	m_rot.y = player_rot.y;
	m_rot.z = player_rot.z * -0.25f;

}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Camera::Render()
{
	SetCameraPositionAndAngle(m_pos.VGet(), TO_RADIAN(m_rot.x), TO_RADIAN(m_rot.y), TO_RADIAN(m_rot.z));
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
